Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
#include "stm32f4xx_hal.h"
#include "pin_config.h"
#include "crc8.h"
#include "pi_link.h"
#include "pi_transport.h"
#include "bmi088.h"
#include "ddsm315.h"
#include "st3215.h"
#include "mahony.h"
#include "kinematics.h"
#include "lqr_controller.h"
#include "safety_state.h"
#include "servo_mapping.h"
#include "startup_manager.h"
#include "firmware_runtime.h"

/* Peripheral Handles */
I2C_HandleTypeDef hi2c1;
UART_HandleTypeDef huart1; /* CH340 Debug/Program */
UART_HandleTypeDef huart2; /* DDSM RS485 */
UART_HandleTypeDef huart3; /* ST3215 Half-Duplex Servo */
UART_HandleTypeDef huart6; /* Pi 5 Bridge */
IWDG_HandleTypeDef hiwdg;
DMA_HandleTypeDef hdma_usart6_rx;
DMA_HandleTypeDef hdma_usart3_rx;

/* ST3215 servo bus RX ring: 1 Mbaud is far beyond single-byte HAL IRQ
 * servicing; a circular DMA plus main-loop consumption removes the overrun
 * storm entirely (see st3215.c note). */
#define ST3215_RX_BUF_SIZE 64U
static uint8_t g_st3215_rx_buf[ST3215_RX_BUF_SIZE];
/* Drain cursor for the ring above; file scope so the RX re-arm path can
 * reset it (a re-armed DMA restarts at buffer base). */
static uint16_t g_st3215_rx_idx = 0U;

/* Real-Time Telemetry and State variables */
volatile uint32_t g_system_ticks = 0;
BMI088_t g_imu;
MahonyFilter_t g_mahony;
LQRController_t g_lqr;

/* One-pole low-pass on pitch rate to suppress gyro noise amplified by K3.
 * α = 0.2 at 1 kHz → τ ≈ 4.5 ms → fc ≈ 35 Hz, well above balance bandwidth. */
static float g_pitch_rate_filt = 0.0f;
#define PITCH_RATE_FILTER_ALPHA 0.2f

/* Latest fused attitude, shared between the DRDY-driven fusion block and the
 * ms-deadline-driven safety block (which must keep running even if DRDY stops). */
static float g_body_pitch = 0.0f;
static float g_body_pitch_rate = 0.0f;

DDSM_State_t g_ddsm_left;
DDSM_State_t g_ddsm_right;
ST3215_State_t g_servos[4];
StartupManager_t g_startup_manager;
uint8_t g_actuator_discovery_step;
uint8_t g_actuator_configured;
/* Per-wheel mask (bit0=left, bit1=right) recording that a current-loop mode
 * frame has been (re)sent while the motor is enabled.  Mode switching while
 * the motor is disabled is unreliable on the DDSM315, so once the wheels are
 * armed we re-assert current mode on each wheel exactly once. */
static uint8_t g_wheel_mode_sent = 0U;
static DDSM_Bus_t g_ddsm_bus;
static ST3215_Bus_t g_st3215_bus;

/* Wheel torque commands computed and sent together at each 250 Hz deadline. */
static float g_ctrl_tau_l = 0.0f;
static float g_ctrl_tau_r = 0.0f;
static volatile float g_body_gyro[3] = {0.0f, 0.0f, 0.0f};

/* Max consecutive servo failures before a fatal FAULT lockdown */
#define SERVO_FAIL_LIMIT         3

/* DMA Buffer for Pi Bridge (USART6 RX) */
#define PI_RX_BUF_SIZE           256
uint8_t g_pi_rx_buf[PI_RX_BUF_SIZE];
static PiTransport_t g_pi_transport;
static volatile uint8_t g_pi_poll_requested = 0U;
static uint8_t g_reset_cause = 0U;

/* Main-loop stall forensics: the SysTick handler (1 ms) watches the loop
 * heartbeat; on a >100 ms stall it snapshots UART status/error evidence to
 * the RAM-top dump area so an interrupt storm starving the loop is visible
 * after the IWDG reset. */
volatile uint32_t g_loop_heartbeat_ms = 0U;
volatile uint32_t g_uart2_err_cnt = 0U;
volatile uint32_t g_uart3_err_cnt = 0U;
volatile uint32_t g_uart6_err_cnt = 0U;
volatile uint32_t g_uart2_rx_cnt = 0U;
volatile uint32_t g_uart3_rx_cnt = 0U;
/* Set by the UART error ISR when an RX error (ORE/NE/FE) fires: the HAL clears
 * CR3.DMAR and aborts the circular RX DMA on overrun, so without a re-arm the
 * bus stays deaf until reboot (observed on USART3: one boot-time ORE killed
 * all servo feedback).  The main loop performs the actual re-arm because the
 * DMA abort completes asynchronously (Receive_DMA returns BUSY inside the ISR). */
volatile uint8_t g_uart3_rx_rearm = 0U;
volatile uint8_t g_uart6_rx_rearm = 0U;

#define STALL_DUMP_BASE  0x2001FFC0U  /* 12 words; ends just below FAULT_DUMP @0x2001FFF0 */
#define STALL_DUMP_MAGIC 0x57A11EDU

void main_loop_stall_check(void) {
    volatile uint32_t *dump = (volatile uint32_t *)STALL_DUMP_BASE;
    uint32_t now = HAL_GetTick();
    if (dump[0] == STALL_DUMP_MAGIC) return;             /* keep first stall */
    if ((uint32_t)(now - g_loop_heartbeat_ms) <= 100U) return;
    dump[1] = g_loop_heartbeat_ms;
    dump[2] = g_system_ticks;
    dump[3] = huart2.Instance->SR;
    dump[4] = huart3.Instance->SR;
    dump[5] = huart6.Instance->SR;
    dump[6] = g_uart2_err_cnt;
    dump[7] = g_uart3_err_cnt;
    dump[8] = g_uart6_err_cnt;
    dump[9] = g_uart2_rx_cnt;
    dump[10] = g_uart3_rx_cnt;
    dump[11] = hdma_usart6_rx.Instance->NDTR;
    dump[0] = STALL_DUMP_MAGIC;
}

/* Function Prototypes */
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_DMA_Init(void);
static void MX_IWDG_Init(void);
static void Pi_Command_Snapshot(Pi_Command_Heartbeat_t *hb, Pi_Command_Action_t *act);
static void Actuator_Feedback_Snapshot(DDSM_State_t *left,
                                       DDSM_State_t *right,
                                       ST3215_State_t servos[4]);
static uint8_t Read_Reset_Cause(void);
static uint16_t Device_Age_Ms(const DeviceHealth_t *health, uint32_t now_ms);
static uint16_t Device_Error_Count(const DeviceHealth_t *health);
static uint16_t Device_Timeout_Count(const DeviceHealth_t *health);
static uint16_t Device_Checksum_Count(const DeviceHealth_t *health);
static uint16_t Device_Protocol_Count(const DeviceHealth_t *health);
void Error_Handler(void);

int main(void) {
    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();
    g_reset_cause = Read_Reset_Cause();

    /* Configure the system clock to 168 MHz */
    SystemClock_Config();

    /* Keep the HAL tick alive under UART interrupt storms: HAL timeouts and
     * delay loops depend on it, and a starved tick turns a bounded 2 ms I2C
     * timeout into an unbounded wait. */
    NVIC_SetPriority(SysTick_IRQn, 0U);

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_I2C1_Init();
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
    MX_USART3_UART_Init();
    MX_USART6_UART_Init();
    MX_IWDG_Init();

    /* Initialize drivers, CRC tables and control states */
    crc8_init();
    pi_link_init();
    pi_transport_init(&g_pi_transport, g_pi_rx_buf, PI_RX_BUF_SIZE);
    safety_state_init();
    lqr_init(&g_lqr);
    mahony_init(&g_mahony, 10.0f, 0.002f); /* Kp high for fast balance tracking */

    g_ddsm_left.id = DDSM_LEFT_ID;
    g_ddsm_right.id = DDSM_RIGHT_ID;
    device_health_init(&g_ddsm_left.health);
    device_health_init(&g_ddsm_right.health);
#if DDSM_ID_CALIBRATION_TARGET > 0
    {
        uint8_t id_packet[DDSM_FRAME_SIZE];
        uint8_t repeat;
        ddsm_build_set_id(id_packet, DDSM_ID_CALIBRATION_TARGET);
        safety_state_trigger_fault(FAULT_WHEEL_LEFT | FAULT_WHEEL_RIGHT);
        HAL_Delay(250U);
        for (repeat = 0U; repeat < 5U; ++repeat) {
            (void)HAL_UART_Transmit(&huart2, id_packet, DDSM_FRAME_SIZE, 20U);
            HAL_Delay(4U);
        }
    }
#endif
    ddsm_bus_init(&g_ddsm_bus, &huart2);
    for (int i = 0; i < 4; i++) {
        g_servos[i].id = i + 1; /* IDs: 1, 2, 3, 4 */
        device_health_init(&g_servos[i].health);
        g_servos[i].health.online = 1U; /* optimistic discovery; first valid read timestamps it */
    }
    st3215_bus_init(&g_st3215_bus, &huart3);

    /* Start Pi Link bridge USART6 reception via DMA */
    __HAL_UART_ENABLE_IT(&huart6, UART_IT_IDLE);
    HAL_UART_Receive_DMA(&huart6, g_pi_rx_buf, PI_RX_BUF_SIZE);

    /* Arm gyro data-ready before starting the non-blocking device sequence. */
    HAL_NVIC_SetPriority(IMU_INT_EXTI_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(IMU_INT_EXTI_IRQn);

#if SERVO_ZERO_CALIBRATION_MODE
    /* A calibration image must never leave INIT and start commanding the
     * placeholder center ticks. FAULT keeps wheel commands at zero while the
     * background servo feedback poll remains active. */
    safety_state_trigger_fault(FAULT_SERVO);
#endif

    uint32_t last_tick = 0;
    uint32_t next_wheel_tx_ms = 0U;
    uint8_t next_wheel_is_right = 0U;
    uint8_t active_servo_query_idx = 0;
    uint32_t last_servo_query_ms = 0U;
    uint8_t fault_servo_disable_idx = 0U;
    uint32_t temp_refresh_counter = 0;
    uint8_t health_telemetry_divider = 0U;
    uint8_t bmi_init_in_progress = 0U;
    uint8_t servo_enable_step = 0U;
    uint8_t servos_enabled = 0U;
    uint8_t wheel_enable_mask = 0U;
    uint32_t next_actuator_enable_ms = 0U;
    uint32_t last_pi_poll_ms = 0U;
    FirmwareRuntime_t firmware_runtime;
    uint8_t control_deadline_pending = 0U;
    uint8_t lqr_deadline_pending = 0U;
    uint8_t hold_ref_anchored = 0U;
    uint8_t servo_deadline_pending = 0U;

