Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
    startup_manager_init(&g_startup_manager, HAL_GetTick());
    firmware_runtime_init(&firmware_runtime, HAL_GetTick());

    /* Main background scheduler loop */
    while (1) {
        uint32_t startup_now = HAL_GetTick();
        g_loop_heartbeat_ms = startup_now;
        StartupInputs_t startup_inputs;
        StartupOutputs_t startup_outputs;
        FirmwareRuntimeInputs_t runtime_inputs;
        FirmwareRuntimeOutputs_t runtime_outputs;
        DDSM_State_t left_feedback;
        DDSM_State_t right_feedback;
        ST3215_State_t servo_feedback[4];
        Pi_Command_Heartbeat_t runtime_heartbeat;
        Pi_Command_Action_t runtime_action;
        uint8_t wheel_authorized;
        uint8_t startup_servos_online = 1U;

        if (g_uart6_rx_rearm) {
            /* Synchronous abort first: HAL clears CR3.DMAR and disables the RX
             * DMA on an ORE/NE/FE, and that teardown completes ASYNCHRONOUSLY.
             * Re-arming without waiting lets the late abort completion wipe the
             * fresh Receive_DMA state (observed on USART3: bus permanently deaf
             * with ORE latched, EIE=0 and no further error callbacks). */
            (void)HAL_UART_AbortReceive(&huart6);
            __HAL_UART_CLEAR_OREFLAG(&huart6);
            if (HAL_UART_Receive_DMA(&huart6, g_pi_rx_buf, PI_RX_BUF_SIZE) == HAL_OK) {
                g_uart6_rx_rearm = 0U;
            }
        } else if ((hdma_usart6_rx.Instance->CR & DMA_SxCR_EN) == 0U) {
            /* Deaf-DMA watchdog: the abort-after-rearm race can end with the
             * stream disabled and no error callback left to fire (EIE cleared),
             * so re-detection must not rely on the error path alone. */
            g_uart6_rx_rearm = 1U;
        }
        if (g_uart3_rx_rearm) {
            (void)HAL_UART_AbortReceive(&huart3);
            __HAL_UART_CLEAR_OREFLAG(&huart3);
            if (HAL_UART_Receive_DMA(&huart3, g_st3215_rx_buf, ST3215_RX_BUF_SIZE) == HAL_OK) {
                g_uart3_rx_rearm = 0U;
                g_st3215_rx_idx = 0U;
            }
        } else if ((hdma_usart3_rx.Instance->CR & DMA_SxCR_EN) == 0U) {
            g_uart3_rx_rearm = 1U;
        }
        if (g_pi_poll_requested || startup_now != last_pi_poll_ms) {
            g_pi_poll_requested = 0U;
            last_pi_poll_ms = startup_now;
            (void)pi_transport_poll(&g_pi_transport,
                                    (uint16_t)__HAL_DMA_GET_COUNTER(&hdma_usart6_rx));
        }

        ddsm_bus_step(&g_ddsm_bus, startup_now);
        /* Drain the ST3215 DMA ring into the bus parser (main-loop context). */
        {
            uint16_t ndtr = (uint16_t)__HAL_DMA_GET_COUNTER(&hdma_usart3_rx);
            uint16_t head = (ndtr == 0U) ? ST3215_RX_BUF_SIZE
                                         : (uint16_t)(ST3215_RX_BUF_SIZE - ndtr);
            while (g_st3215_rx_idx != head) {
                ++g_uart3_rx_cnt;
                st3215_bus_rx_byte_from_dma(&g_st3215_bus,
                                            g_st3215_rx_buf[g_st3215_rx_idx],
                                            startup_now);
                g_st3215_rx_idx = (uint16_t)((g_st3215_rx_idx + 1U) % ST3215_RX_BUF_SIZE);
            }
        }
        st3215_bus_step(&g_st3215_bus, startup_now);
        Actuator_Feedback_Snapshot(&left_feedback, &right_feedback, servo_feedback);
        Pi_Command_Snapshot(&runtime_heartbeat, &runtime_action);
        (void)runtime_action;
        /* Wheel torque authorization for the LQR self-balance loop.
         * Self-balancing is a baseline capability that must work standalone
         * (no Pi), so it is gated only on startup completion + no fault + a
         * sane operating mode. Pi link freshness only gates the ACTIVE-mode
         * motion commands, not the balance loop itself. */
        wheel_authorized = (uint8_t)(g_startup_manager.phase == STARTUP_READY &&
                                     g_safety_state.current_mode != STATE_FAULT);

        runtime_inputs.now_ms = startup_now;
        runtime_inputs.mode = g_safety_state.current_mode;
        runtime_inputs.link_compatible = pi_link_is_compatible();
        runtime_inputs.heartbeat_fresh = pi_link_heartbeat_fresh();
        runtime_inputs.action_fresh = pi_link_action_fresh();
        runtime_inputs.wheel_authorized = wheel_authorized;
        runtime_inputs.wheel_bus_idle = ddsm_bus_is_idle(&g_ddsm_bus);
        runtime_inputs.servo_bus_idle = st3215_bus_is_idle(&g_st3215_bus);
        runtime_outputs = firmware_runtime_step(&firmware_runtime, &runtime_inputs);
        if (runtime_outputs.control_due) control_deadline_pending = 1U;
        if (runtime_outputs.servo_due) servo_deadline_pending = 1U;

        if (bmi_init_in_progress) {
            int bmi_result = bmi088_init_step(&g_imu, startup_now);
            if (bmi_result != 0) {
                bmi_init_in_progress = 0U;
            }
        }

        for (int i = 0; i < 4; ++i) {
            if (!device_health_is_fresh(&servo_feedback[i].health,
                                        startup_now,
                                        SAFETY_SERVO_MAX_AGE_MS)) {
                startup_servos_online = 0U;
            }
        }
        startup_inputs.now_ms = startup_now;
        startup_inputs.imu_initialized = g_imu.initialized;
        startup_inputs.gyro_calibrated = g_safety_state.is_gyro_calibrated;
        startup_inputs.wheel_l_online = device_health_is_fresh(&left_feedback.health,
                                                               startup_now,
                                                               SAFETY_WHEEL_MAX_AGE_MS);
        startup_inputs.wheel_r_online = device_health_is_fresh(&right_feedback.health,
                                                               startup_now,
                                                               SAFETY_WHEEL_MAX_AGE_MS);
        startup_inputs.servos_online = startup_servos_online;
        startup_inputs.actuator_configured = g_actuator_configured;
        startup_outputs = startup_manager_step(&g_startup_manager, &startup_inputs);

        if (startup_outputs.request_imu_init && !g_imu.initialized && !bmi_init_in_progress) {
            bmi088_begin_init(&g_imu, &hi2c1, startup_now);
            bmi_init_in_progress = 1U;
        }

        if (g_startup_manager.phase == STARTUP_ACTUATOR_DISCOVERY &&
            !g_actuator_configured) {
            int discovery_result = -1;
            if (g_actuator_discovery_step == 0U) {
                /* Bring the motor out of its power-up state first (Protocol-3
                 * mode switching is only honoured once the motor is enabled). */
                discovery_result = ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_left,
                                                         0U, startup_now);
            } else if (g_actuator_discovery_step == 1U) {
                /* Select the current (torque) loop.  Protocol-3 form: byte[9]=mode
                 * with no CRC.  Re-asserted while enabled after arming too. */
                discovery_result = ddsm_bus_queue_mode(&g_ddsm_bus, &g_ddsm_left,
                                                       DDSM_MODE_CURRENT, startup_now);
            } else if (g_actuator_discovery_step == 2U) {
                /* Explicit zero-torque clears any stale torque retained across
                 * power cycles so the motor does not spin before the Pi arms. */
                discovery_result = ddsm_bus_queue_torque(&g_ddsm_bus, &g_ddsm_left,
                                                         0.0f, startup_now);
            } else if (g_actuator_discovery_step == 3U) {
                discovery_result = ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_right,
                                                         0U, startup_now);
            } else if (g_actuator_discovery_step == 4U) {
                discovery_result = ddsm_bus_queue_mode(&g_ddsm_bus, &g_ddsm_right,
                                                       DDSM_MODE_CURRENT, startup_now);
            } else if (g_actuator_discovery_step == 5U) {
                discovery_result = ddsm_bus_queue_torque(&g_ddsm_bus, &g_ddsm_right,
                                                         0.0f, startup_now);
            } else if (g_actuator_discovery_step == 6U) {
                discovery_result = st3215_bus_queue_torque(
                    &g_st3215_bus, ST3215_BROADCAST_ID, 0U);
            }
            if (g_actuator_discovery_step < 7U && discovery_result == 0) {
                ++g_actuator_discovery_step;
            }
            g_actuator_configured = (uint8_t)(g_actuator_discovery_step >= 7U);
        }

        if (startup_outputs.enable_actuators && !servos_enabled &&
            (int32_t)(startup_now - next_actuator_enable_ms) >= 0) {
            int enable_result = -1;
            if (servo_enable_step < 4U) {
#if SERVO_ZERO_CALIBRATION_MODE
                enable_result = st3215_bus_queue_torque(
                    &g_st3215_bus, (uint8_t)(servo_enable_step + 1U), 0U);
#else
                enable_result = st3215_bus_queue_torque(
                    &g_st3215_bus, (uint8_t)(servo_enable_step + 1U), 1U);
#endif
            }
            if (servo_enable_step < 4U && enable_result == 0) {
                ++servo_enable_step;
            }
            next_actuator_enable_ms = startup_now + 5U;
            servos_enabled = (uint8_t)(servo_enable_step >= 4U);
        }

        /* Wheel power is a separately armed safety domain.  Discovery and
         * zero-current polling run while disabled; enabling requires an
         * authenticated, fresh Pi mode request and is revoked on link loss. */
        if (wheel_authorized && wheel_enable_mask != 0x03U && ddsm_bus_is_idle(&g_ddsm_bus)) {
            if ((wheel_enable_mask & 0x01U) == 0U) {
                if (ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_left, 1U, startup_now) == 0) {
                    wheel_enable_mask |= 0x01U;
                }
            } else if (ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_right, 1U, startup_now) == 0) {
                wheel_enable_mask |= 0x02U;
            }
        } else if (!wheel_authorized && wheel_enable_mask != 0U && ddsm_bus_is_idle(&g_ddsm_bus)) {
            if ((wheel_enable_mask & 0x01U) != 0U) {
                if (ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_left, 0U, startup_now) == 0) {
                    wheel_enable_mask &= (uint8_t)~0x01U;
                }
            } else if (ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_right, 0U, startup_now) == 0) {
                wheel_enable_mask &= (uint8_t)~0x02U;
            }
        }

        /* Once both wheels are armed, re-assert the current-loop mode on any
         * wheel that has not yet received it while enabled.  Mode switching is
         * only reliably honoured by the DDSM315 after the motor is enabled. */
        if (g_actuator_configured && wheel_enable_mask == 0x03U &&
            g_wheel_mode_sent != 0x03U && ddsm_bus_is_idle(&g_ddsm_bus)) {
            if ((g_wheel_mode_sent & 0x01U) == 0U) {
                if (ddsm_bus_queue_mode(&g_ddsm_bus, &g_ddsm_left,
                                        DDSM_MODE_CURRENT, startup_now) == 0) {
                    g_wheel_mode_sent |= 0x01U;
                }
            } else if ((g_wheel_mode_sent & 0x02U) == 0U) {
                if (ddsm_bus_queue_mode(&g_ddsm_bus, &g_ddsm_right,
                                        DDSM_MODE_CURRENT, startup_now) == 0) {
                    g_wheel_mode_sent |= 0x02U;
                }
            }
        }

