Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
        /* Dispatch wheel torque commands at the DDSM315 bus limit.
         * At 115200 baud a 10-byte frame takes ~0.87 ms TX + ~0.87 ms RX;
         * the 4 ms spacing matches the original bus scheduling and gives each
         * wheel a 125 Hz update rate.  Removing it caused RS485 overruns. */
        if (g_actuator_configured && ddsm_bus_is_idle(&g_ddsm_bus) &&
            (int32_t)(startup_now - next_wheel_tx_ms) >= 0) {
            int wheel_result;
            DDSM_State_t *wheel = next_wheel_is_right ? &g_ddsm_right : &g_ddsm_left;
            float torque = next_wheel_is_right
                         ? WHEEL_DIR_R * g_ctrl_tau_r
                         : WHEEL_DIR_L * g_ctrl_tau_l;
            if (runtime_outputs.wheel_intent_allowed) {
                wheel_result = ddsm_bus_queue_torque(&g_ddsm_bus, wheel,
                                                     torque, startup_now);
            } else if (g_safety_state.current_mode == STATE_FAULT) {
                wheel_result = ddsm_bus_queue_torque(&g_ddsm_bus, wheel,
                                                     0.0f, startup_now);
            } else {
                wheel_result = ddsm_bus_queue_query(&g_ddsm_bus, wheel, startup_now);
            }
            if (wheel_result == 0) {
                next_wheel_is_right ^= 1U;
                next_wheel_tx_ms = startup_now + 4U;
            }
        }

        if (startup_outputs.fault_requested) {
            safety_state_trigger_fault(FAULT_INIT);
        }

        /* Reaching this point proves the scheduler is alive even before DRDY. */
        HAL_IWDG_Refresh(&hiwdg);

        /* Consume the 250 Hz control deadline (HAL_GetTick-based) OUTSIDE the
         * DRDY tick gate below.  The safety state machine must keep running
         * when gyro DRDY stops: previously it lived inside the DRDY-gated
         * tick block, so a dead BMI088 froze fault detection while the DDSM
         * dispatch kept streaming the last cached torque command forever.
         *
         * The LQR deadline is LATCHED into lqr_deadline_pending instead of
         * being consumed here: the LQR block only executes on a DRDY tick,
         * and most loop iterations have none, so consuming the deadline at
         * this point would silently drop ~3 of every 4 control cycles and
         * leave the robot effectively open-loop. */
        uint8_t control_due = control_deadline_pending;
        if (control_due) {
            control_deadline_pending = 0U;
            lqr_deadline_pending = 1U;
        }

        /* Safety state machine update at 250 Hz on the ms deadline.  Uses the
         * latest fused attitude published by the DRDY block (g_body_pitch /
         * g_body_pitch_rate); if the IMU dies, imu_fresh goes stale and the
         * debounced freshness fault latches FAULT regardless of DRDY. */
        if (control_due && g_startup_manager.phase >= STARTUP_ACTUATOR_DISCOVERY) {
            float max_temp = g_imu.temperature;
            for (int i = 0; i < 4; i++) {
                if (servo_feedback[i].temperature_c > max_temp) {
                    max_temp = servo_feedback[i].temperature_c;
                }
            }
            SafetyInputs_t safety_inputs;
            SafetyDecision_t safety_decision;
            uint32_t safety_now = HAL_GetTick();
            uint8_t servos_fresh = 1U;
            for (int i = 0; i < 4; ++i) {
                if (!device_health_is_fresh(&servo_feedback[i].health,
                                            safety_now,
                                            SAFETY_SERVO_MAX_AGE_MS)) {
                    servos_fresh = 0U;
                }
            }
            safety_inputs.now_ms = safety_now;
            safety_inputs.pitch_rad = g_body_pitch;
            safety_inputs.pitch_rate_rads = g_body_pitch_rate;
            safety_inputs.max_temp_c = max_temp;
            safety_inputs.gyro_calibrated = g_safety_state.is_gyro_calibrated;
            safety_inputs.startup_ready = servos_enabled;
            safety_inputs.imu_fresh = device_health_is_fresh(&g_imu.health,
                                                             safety_now,
                                                             SAFETY_IMU_MAX_AGE_MS);
            safety_inputs.wheel_l_fresh = device_health_is_fresh(&left_feedback.health,
                                                                 safety_now,
                                                                 SAFETY_WHEEL_MAX_AGE_MS);
            safety_inputs.wheel_r_fresh = device_health_is_fresh(&right_feedback.health,
                                                                 safety_now,
                                                                 SAFETY_WHEEL_MAX_AGE_MS);
            safety_inputs.servos_fresh = servos_fresh;
            safety_inputs.link_compatible = pi_link_is_compatible();
            safety_inputs.heartbeat_fresh = pi_link_heartbeat_fresh();
            safety_inputs.action_fresh = pi_link_action_fresh();
            safety_inputs.requested_mode = g_pi_cmd_heartbeat.mode_request;
            safety_decision = safety_state_update(&safety_inputs);
            if (safety_decision.enter_hold) {
                pi_link_enter_hold();
            } else if (safety_decision.clear_action) {
                pi_link_clear_action();
            }
            if (g_safety_state.current_mode == STATE_FAULT ||
                g_safety_state.current_mode == STATE_INIT) {
                /* Zero the cached wheel commands on FAULT/INIT.  This must
                 * happen on the ms deadline (not the DRDY tick) so a dead IMU
                 * cannot leave a stale non-zero torque latched. */
                g_ctrl_tau_l = 0.0f;
                g_ctrl_tau_r = 0.0f;
            }
        }

        /* Soft real-time scheduler aligned to system ticks (1ms resolution) */
        if (g_system_ticks != last_tick) {
            /* Use the actual elapsed time; blocking bus I/O can skip ticks.
             * Clamp the fusion step: after a long main-loop stall (e.g. an
             * interrupt storm) dticks spans hundreds of ms, and integrating
             * the quaternion with dt~1 s would blow up the attitude. */
            uint32_t dticks = g_system_ticks - last_tick;
            last_tick = g_system_ticks;
            float fusion_dt = (float)dticks * 0.001f;
            if (fusion_dt > 0.02f) fusion_dt = 0.02f;

            /* DRDY can arrive while the BMI088 register sequence is still in
             * progress.  Do not read or calibrate from an uninitialized IMU. */
            if (!g_imu.initialized) {
                continue;
            }

            /* 1. Read IMU sensors (safe to do here in the main loop background) */
            bmi088_read_accel(&g_imu);
            bmi088_read_gyro(&g_imu);

