Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
            /* Refresh chip temperature at low rate (~10 Hz) for safety/telemetry */
            if (++temp_refresh_counter >= 100) {
                temp_refresh_counter = 0;
                bmi088_read_temp(&g_imu);
            }

            float gx = g_imu.gyro[0];
            float gy = g_imu.gyro[1];
            float gz = g_imu.gyro[2];

            /* 2. Run sensor fusion update */
            if (g_safety_state.is_gyro_calibrated) {
                gx -= g_safety_state.gyro_calib_offset[0];
                gy -= g_safety_state.gyro_calib_offset[1];
                gz -= g_safety_state.gyro_calib_offset[2];
            }
            /* Always fuse attitude.  Mahony is accel-referenced, so running
             * with a zero gyro offset at start is safe; the bias estimate is
             * refined in the background (below) once the robot settles. */
            mahony_update(&g_mahony,
                          g_imu.accel[0], g_imu.accel[1], g_imu.accel[2],
                          gx, gy, gz, fusion_dt);
            if (!g_safety_state.is_gyro_calibrated) {
                safety_state_gyro_calib_update(gx, gy, gz, HAL_GetTick());
            }
            g_body_gyro[0] = gx;
            g_body_gyro[1] = gy;
            g_body_gyro[2] = gz;

            /* Balance-relevant tilt & rate mapped to the physical IMU mounting.
             * Pitch rate uses the bias-corrected gyro (offset is 0 until calibrated). */
            float body_pitch = ATT_PITCH(&g_mahony);
            float body_pitch_rate = ATT_PITCH_RATE_SIGN *
                (g_imu.gyro[ATT_PITCH_RATE_IDX] - g_safety_state.gyro_calib_offset[ATT_PITCH_RATE_IDX]);
            /* Low-pass filter pitch rate: the raw gyro Y has broadband noise
             * that K3 amplifies into torque chatter.  A 35 Hz one-pole filter
             * preserves the balance-relevant dynamics while cutting noise. */
            g_pitch_rate_filt += PITCH_RATE_FILTER_ALPHA *
                (body_pitch_rate - g_pitch_rate_filt);
            body_pitch_rate = g_pitch_rate_filt;

            /* Publish the latest attitude for the ms-deadline safety block. */
            g_body_pitch = body_pitch;
            g_body_pitch_rate = body_pitch_rate;

            /* 3. Run the 250 Hz motor deadline and lower-rate telemetry slots. */
            uint8_t slot = last_tick % 4;

            /* --- Control deadline: compute and cache both wheel commands.
             * Runs on the first DRDY tick after each latched 250 Hz deadline. */
            if (lqr_deadline_pending &&
                g_startup_manager.phase >= STARTUP_ACTUATOR_DISCOVERY) {
                lqr_deadline_pending = 0U;
                if (runtime_outputs.wheel_intent_allowed) {
                    /* Snapshot Pi commands atomically (updated in USART6 ISR) */
                    Pi_Command_Heartbeat_t hb;
                    Pi_Command_Action_t act;
                    Pi_Command_Snapshot(&hb, &act);
                    /* Average wheel velocity in body frame -> forward speed ẋ.
                     * All command and residual fields now use the shared P0 contract. */
                    float wheel_vel_l = WHEEL_DIR_L * left_feedback.velocity_rads;
                    float wheel_vel_r = WHEEL_DIR_R * right_feedback.velocity_rads;
                    float yaw_rate = gz;
                    if (!pi_link_is_compatible() || !pi_link_heartbeat_fresh()) {
                        /* Re-anchor the hold reference ONCE on link loss, not
                         * every cycle: resetting x_ref to x_est continuously
                         * pins x_error at zero and silently disables the K0
                         * position loop and the LQI integrator, so the robot
                         * cruises away instead of holding its position. */
                        if (!hold_ref_anchored) {
                            lqr_reset(&g_lqr, g_lqr.x_est, g_mahony.yaw);
                            hold_ref_anchored = 1U;
                        }
                    } else {
                        hold_ref_anchored = 0U;
                    }

                    /* Run LQR once per 250 Hz cycle; cache both wheel commands. */
                    lqr_update(&g_lqr,
                               body_pitch,
                                body_pitch_rate,
                                wheel_vel_l,
                                wheel_vel_r,
                                g_mahony.yaw,
                                yaw_rate,
                                hb.target_velocity,
                                hb.target_yaw_rate,
                                runtime_outputs.residual_allowed
                                    ? act.delta_torque_common : 0.0f,
                                runtime_outputs.residual_allowed
                                    ? act.delta_torque_yaw : 0.0f,
                                &g_ctrl_tau_l,
                                &g_ctrl_tau_r);

                    /* Pitch-gated torque fade: full authority inside the
                     * recoverable band, linearly decaying to zero as the
                     * body tips past PITCH_FADE_END so a fallen robot does
                     * not spin its wheels at full torque. */
                    {
                        float ap = fabsf(body_pitch);
                        float scale;
                        if (ap <= PITCH_FADE_START_RAD) {
                            scale = 1.0f;
                        } else if (ap >= PITCH_FADE_END_RAD) {
                            scale = 0.0f;
                        } else {
                            scale = (PITCH_FADE_END_RAD - ap) /
                                    (PITCH_FADE_END_RAD - PITCH_FADE_START_RAD);
                        }
                        g_ctrl_tau_l *= scale;
                        g_ctrl_tau_r *= scale;
                    }

                }
                /* FAULT/INIT torque zeroing lives in the ms-deadline safety
                 * block above so it cannot be frozen by a stopped DRDY. */
            }

